# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

In [2]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [3]:
black_friday.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [4]:
black_friday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [5]:
black_friday.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [17]:
black_friday.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

In [23]:
black_friday['Age'].value_counts()

26-35    214690
36-45    107499
18-25     97634
46-50     44526
51-55     37618
55+       20903
0-17      14707
Name: Age, dtype: int64

In [24]:
pd.crosstab(black_friday.Gender,black_friday.Age)

Age     0-17  18-25   26-35  36-45  46-50  51-55    55+
Gender
F       4953  24057   49348  26420  12856   9634   4929
M       9754  73577  165342  81079  31670  27984  15974

In [66]:
#nulos em Product_Category_2
len(black_friday.query("Product_Category_2 == 'NaN'"))

166986

In [67]:
#nulos em Product_Category_3
len(black_friday.query("Product_Category_3 == 'NaN'"))

373299

In [69]:
# Quantidade de valores nulos em Product_Category_2 que NÃO são nulos em Product_Category_3
len(black_friday.query("Product_Category_2 == 'NaN' & Product_Category_3 != 'NaN'"))

0

In [70]:
# Quantidade de valores nulos em Product_Category_2 que TAMBÉM são nulos em Product_Category_3
len(black_friday.query("Product_Category_2 == 'NaN' & Product_Category_3 == 'NaN'"))

166986

In [94]:
def q10():
    # Retorne aqui o resultado da questão 10.
   return bool(len(black_friday.query("Product_Category_2=='NaN' & Product_Category_3=='NaN'")))
 
q10()

True

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [22]:
def q1():
    # Retorne aqui o resultado da questão 1.
    return black_friday.shape 
    pass

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [26]:
def q2():
    # Retorne aqui o resultado da questão 2.
    return black_friday.query("Gender == 'F' & Age == '26-35'").shape[0]
    pass

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [28]:
def q3():
    # Retorne aqui o resultado da questão 3.
    return black_friday.User_ID.nunique()
    pass

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [7]:
def q4():
    # Retorne aqui o resultado da questão 4.
    return black_friday.dtypes.nunique()
    pass

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [35]:
def q5():
    # Retorne aqui o resultado da questão 5.
    return (black_friday.shape[0]-black_friday.dropna().shape[0])/black_friday.shape[0]
    pass

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [39]:
def q6():
    # Retorne aqui o resultado da questão 6.
    return black_friday.isna().sum().max()
    pass

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [48]:
def q7():
    # Retorne aqui o resultado da questão 7.
    return float(black_friday.Product_Category_3.mode())
    pass

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [87]:
def q8():
    # Retorne aqui o resultado da questão 8.
    return ((black_friday['Purchase'] - black_friday['Purchase'].min())/
           (black_friday['Purchase'].max()-black_friday['Purchase'].min())).mean()
    pass

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [99]:
def q9():
    # Retorne aqui o resultado da questão 9.
    purchase_stand = (black_friday.Purchase - black_friday.Purchase.mean()) / black_friday.Purchase.std()
    return len(purchase_stand[(purchase_stand > -1) & (purchase_stand < 1)])
    pass

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [100]:
def q10():
    # Retorne aqui o resultado da questão 10.
    return bool(len(black_friday.query("Product_Category_2=='NaN' & Product_Category_3=='NaN'")))
    pass